Strömungssimulation/cylinderRe80/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
6750
(
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
135
(
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
135
(
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
...
)
;
    }
    obstacle
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0 -0 0.485668)
(0 -1.75097e-17 0.52786)
(0 1.81205e-17 0.571004)
(0 -1.30019e-18 0.614777)
(0 -0 0.658759)
(0 -0 0.70243)
(0 -0 0.745169)
(0 -0 0.786258)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
