Strömungssimulation/cylinderRe80/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


vertices
(
    // pre-block
    (-25   -20   0.5) // 0
    ( -20  -20   0.5) // 1
    ( -20  -20  -0.5) // 2 
    (-25   -20  -0.5) // 3
    
    (-25    20   0.5) // 4
    ( -20   20   0.5) // 5
    ( -20   20  -0.5) // 6
    (-25    20  -0.5) // 7

    // obstacle blocks
    (  20  -20  0.5) // 8
    (  20  -20 -0.5) // 9

    (-1.767766953 -1.767766953  0.5) // 10
    ( 1.767766953 -1.767766953  0.5) // 11
    ( 1.767766953 -1.767766953 -0.5) // 12
    (-1.767766953 -1.767766953 -0.5) // 13

    (-1.767766953  1.767766953  0.5) // 14
    (-1.767766953  1.767766953 -0.5) // 15

    ( 1.767766953  1.767766953  0.5) // 16
    ( 1.767766953  1.767766953 -0.5)

    (  20   20  0.5) // 18
    (  20   20 -0.5) // 19

    // post-block
    (   120   -20  0.5) // 20
    (   120   -20 -0.5) // 21
    (   120    20  0.5) // 22
    (   120    20 -0.5) // 23
);

blocks
(
    // pre-block
    hex ( 0  1  2  3  4  5  6  7) ( 5 1 30) simpleGrading (	0.5 
	    							1
	    							(
								 (0.5 0.5 0.5)
								 (0.5 0.5 2)
								) )

    // obstacle blocks
    hex ( 1  8  9  2 10 11 12 13) (30 1 30) simpleGrading (1 1 0.5 ) // bottom
    hex ( 1 10 13  2  5 14 15  6) (30 1 30) simpleGrading (	0.5
 								1 
	    							(
								 (0.5 0.5 0.5)
								 (0.5 0.5 2)
								) ) // left
    hex (14 16 17 15  5 18 19  6) (30 1 30) simpleGrading (1 1 2) // top
    hex (11  8  9 12 16 18 19 17) (30 1 30) simpleGrading (	2 
 								1 
	    							(
								 (0.5 0.5 0.5)
								 (0.5 0.5 2)
								) ) // right

    // post-block
    hex ( 8 20 21  9 18 22 23 19) (100 1 30) simpleGrading (	1 
	    							1
	    							(
								 (0.5 0.5 0.5)
								 (0.5 0.5 2)
								) )
);

edges
(
    arc 10 11 (   0 -2.5  0.5)
    arc 12 13 (   0 -2.5 -0.5)
    arc 14 10 (-2.5    0  0.5)
    arc 15 13 (-2.5    0 -0.5)
    arc 14 16 (   0  2.5  0.5)
    arc 15 17 (   0  2.5 -0.5)
    arc 16 11 ( 2.5    0  0.5)
    arc 17 12 ( 2.5    0 -0.5)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            ( 0  4  7  3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (20 21 23 22)
        );
    }
    top
    {
        type wall;
        faces
        (
            ( 4  5  6  7)
            ( 5 18 19  6)
            (18 22 23 19)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            ( 0  1  2  3)
            ( 1  8  9  2)
            ( 8 20 21  9)
        );
    }
    obstacle
    {
        type wall;
        faces
        (
            (10 11 12 13)
            (11 16 17 12)
            (14 16 17 15)
            (10 14 15 13)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            ( 0  1  5  4)
            ( 1 10 14  5)
            (14 16 18  5)
            (11  8 18 16)
            ( 1  8 11 10)
            ( 8 20 22 18)

            ( 3  7  6  2)
            ( 2  6 15 13)
            (15  6 19 17)
            (12 17 19  9)
            ( 2 13 12  9)
            ( 9 19 23 21)
        );
    }
);

mergePatchPairs
(
);
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
