Strömungssimulation/cylinderRe80/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*defaultFieldValues
(
    volVectorFieldValue U (0.2 0 0)
);*/

regions
(
    // Set cell values
    // (does zerogradient on boundaries)
    boxToCell
    {
        box     (-5 -5 -0.6)(-3 -3 0.6);

        fieldValues
        (
            volVectorFieldValue U (0.1 0 0)
        );
    }
);

// ************************************************************************* //
